import numpy as np

n = 10
shape = (2, 3)
shape2 = (2, 3, 4)
shape3 = (3, 8)


# .ndim 数组的维度，即数组中有几组
# .shape 数组的结构，开关
# .size 数组中元素的个数
# .itemsize 数组中元素的字节大小

# 类似 range 函数，返回ndarray类型，元素从 0 到 n-1
np.arange(n)

# 根据 shape 生成一个全1数值的数组，shape是元组类型
a = np.ones(shape, dtype=int)

# 根据 shape 生成一个全0数值的数组，shape是元组类型
np.zeros(shape)

# 根据shape生成一个数组，每个元素值都是val
np.full(shape,n)

# 创建一个正方的n*n单位矩阵，对角线为1，其余为0
np.eye(3)

# 根据数组a的形状生成一个全1数组
np.ones_like(a)

# 根据数组a的形状生成一个全0数组
np.zeros_like(a)

# 根据数组a的形状生成一个数组，每个元素值都是val
np.full_like(a, n)


# 根据起止数据等间距地填充数据，形成数组
# [ 1.  4.  7. 10.]
a = np.linspace(1, 10, 4)
b = np.linspace(1, 10, 4, endpoint=False)

# 将两个或多个数组合并成一个新的数组
# [ 1.    4.    7.   10.    1.    3.25  5.5   7.75]
c = np.concatenate((a, b))

a = np.ones(shape2, dtype=np.int16)

# 不改变数组元素，返回一个shape形状的新数组，原数组不变
b = a.reshape(shape3)
"""
[[[1 1 1 1]
  [1 1 1 1]
  [1 1 1 1]]
 [[1 1 1 1]
  [1 1 1 1]
  [1 1 1 1]]]

[[1 1 1 1 1 1 1 1]
 [1 1 1 1 1 1 1 1]
 [1 1 1 1 1 1 1 1]]
"""

# 与.reshape0功能一致，但修改原数组
a.resize(shape3)

# 将数组n个维度中两个维度进行调换
# a.swapaxes(ax1,ax2)

# 对数组进行降维，返回展开后的一维新数组，原数组不变
a.flatten()
# [1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1]

# 数值类型的转换，返回新数组
a.astype(np.float16)

# 数组值转列表，但其内部 shape 形状不变
a.tolist()


a = np.array([1, 2, 3, 4, 5])
# a[2] = 3

# [2, 4]
b = a[1: 4: 2]

a = np.arange(24).reshape((2, 3, 4))
"""
[[[ 0  1  2  3]
  [ 4  5  6  7]
  [ 8  9 10 11]]

 [[12 13 14 15]
  [16 17 18 19]
  [20 21 22 23]]]
"""
# 23
b = a[1, 2, 3]

# 6
b = a[0, 1, 2]

# 17
b = a[-1, -2, -3]

# [5, 17]
b = a[:, 1, -3]

#  [ 4  5  6  7]
#   [ 8  9 10 11]
# [16 17 18 19]
#   [20 21 22 23]
b = a[:, 1:3, :]

"""
[[[ 0, 2]
  [ 4, 6]
  [ 8, 10]]

 [[12, 14]
  [16, 18]
  [20, 22]]]
"""
b = a[:, :, ::2]


# 取数组中所有元素和的平均值，这是一个值，即标量
b = a.mean()

# 数组与标量进行计算，就是数组中每个元素与标量的计算
a = a / b
"""
[[[0.         0.08695652 0.17391304 0.26086957]
  [0.34782609 0.43478261 0.52173913 0.60869565]
  [0.69565217 0.7826087  0.86956522 0.95652174]]

 [[1.04347826 1.13043478 1.2173913  1.30434783]
  [1.39130435 1.47826087 1.56521739 1.65217391]
  [1.73913043 1.82608696 1.91304348 2.        ]]]
"""

# np.abs(x) 或 np.fabs(x)，计算数组各元素的绝对值
# np.sqrt(x)，计算数组各元素的平方根
# np.square(x)，计算数组各元素的平方
# np.log(x)，np.log10(x)，np.log2(x)，计算数组各元素的自然对数、10底对数和2底对数
# np.ceil(x)，np.floor(x)，计算数组各元素的 ceiling 向上取整值或 floor 向下取整值

# np.rint(x)，计算数组各元素的四舍五入值
# np.modf(x)，将数组各元素的小数和整数部分以两个独立数组形式返回，即返回元组，先小数数组，再整数数组（也是 float 类型）
# 计算数组各元素的普通型和双曲型三角函数
# np.cos(x)np.cosh(x)np.sin(x)np.sinh(x)np.tan(x)np.tanh(x)
# np.exp(x)，计算数组各元素的指数值
# np.sign(x)，计算数组各元素的符号值，1(+正数时)，0,-1(-负数时)

# nparray 数组的运算
# + - * / **，两个数组各元素进行对应运算
# np.maximum(x,y)，np.fmax()，np.minimum(x,y)，np.fmin()，元素级的最大值/最小值计算，返回对应的最大/最小值
# np.mod(x,y)，元素级的模运算
# np.copysign(x,y)，将数组y中各元素值的符号赋值给数组x对应的元素
# > < >= <= == !=，算术比较，产生布尔型数组，每个元素对应着一个 bool

# axis 为整数或元组（指定数组中的维度），None 则表示对数组中所有元素计算
# np.sum(a,axis=None)，根据给定轴 axis 维度，计算数组 a 中所有元素之和
# average(a,axis=None,weights-None)
# std(a,axis-None)
# var(a,axis=None)


print(a)